webpackHotUpdate("static\\development\\pages\\index.js",{

/***/ "./db/lugInfo.json":
/*!*************************!*\
  !*** ./db/lugInfo.json ***!
  \*************************/
/*! exports provided: lugDays, default */
/***/ (function(module) {

module.exports = JSON.parse("{\"lugDays\":[{\"id\":1,\"date\":\"جمعه 29 شهریور ساعت 11 صبح\",\"pic\":\"/lugs/lug-1/person/Richard_Matthew_Stallman.jpeg\",\"lugEvents\":[{\"name\":\"لاگ رامسر\",\"author\":\"محسن شعبانیان\",\"body\":\"اولین ارائه امروز، توضیحی بود در مورد لاگ، تاریخچه لاگ، و اهداف ما از برگزاری لاگ\",\"type\":\"Present\",\"tags\":[]},{\"name\":\"ریچارد استالمن\",\"author\":\"محسن شعبانیان\",\"body\":\"دومین ارائه در مورد #استالمن از بنیانگذار جنبش نرم افزار های آزاد و پایه گذار بنیاد #گنو بود. به مناسبت خبر استعفای او از بنیاد و دانشگاه ماساچوست\",\"type\":\"Person\",\"tags\":[]},{\"name\":\"nohup\",\"author\":\"محسن شعبانیان\",\"body\":\"دستور لینوکسی این هفته nohup بود\",\"type\":\"Command\",\"tags\":[]},{\"name\":\"بلاکچین و رمزارز ها\",\"body\":\"بحث و گفتگوی این هفته هم در مورد بلاکچین و رمزارز ها بود\",\"type\":\"Discuss\",\"tags\":[]}]},{\"id\":2,\"date\":\"جمعه 5 مهر ساعت 11 صبح\",\"pic\":\"/img/lug-1/person/Richard_Matthew_Stallman.jpeg\",\"lugEvents\":[{\"name\":\"کامپیوتر های کوانتومی\",\"author\":\"محسن شعبانیان\",\"body\":\"به مناسبت پخش خبر برتری کوانتومی توسط گوگل، ارائه این هفته در مورد کامپیوتر های کوانتومی بود.\",\"type\":\"Present\",\"tags\":[]},{\"name\":\"اروین شرودینگر\",\"author\":\"محسن شعبانیان\",\"body\":\"در ادامه بحث کامپیوتر های کوانتومی، شخصیت هفته، اروین شرودینگر یکی از افراد مهم در این رشته بود. در مورد ایده ها و نظریاتش و معادله شروینگر و #گربه_شرودینگر با هم صحبت کردیم\",\"type\":\"Person\",\"tags\":[]},{\"name\":\"man\",\"author\":\"محسن شعبانیان\",\"body\":\"دستور لینوکسی این هفته man بود\",\"type\":\"Command\",\"tags\":[]},{\"name\":\"زبان های برنامه نویسی\",\"body\":\"بحث و گفتگوی این هفته هم در مورد زبان های برنامه نویسی بود\",\"type\":\"Discuss\",\"tags\":[]}]}]}");

/***/ })

})
//# sourceMappingURL=index.js.b52666009a41299a0f76.hot-update.js.map