import WebsiteLayout from "../components/websiteLayout";

const About = () =>
  (
    <WebsiteLayout>
      <div id="about-page" className="container">
        <h2>درباره ما</h2>
        <p>لاگ رامسر، نشست هفتگی، عمومی و رایگان علاقه‌مندان به تکنولوژی و کامپیوتر هست، به همراه بحث و گفتگو در زمینه های مختلف و کارگاه و ارائه های کوتاه در زمینه های مختلف.</p>

        <h4>لاگ چیه، شما کی هستید و چه‌کاری می‌کنید؟ </h4>
        <p>لاگ (به انگلیسی: LUG) با حرف اول واژه‌های عبارت Linux Users Group (ترجمه: گروه کاربران لینوکس) ساخته شده. ما گروهی از افراد داوطلبانه، غیردولتی و غیرانتفاعی هستیم که نشست‌ها و گفتگوهایی رو ترتیب می‌دیم و اگر فرصتش پیش بیاد رویدادهایی اجتماعی رو برگزار می‌کنیم. اهداف لاگ از این قراره: </p>
        <ul>
          <li>فراهم آوردن این امکان برای کاربران در هر سن و با هر زمینه‌ای تا با دیگر کاربران سیستم‌عامل گنو/لینوکس و نرم‌افزارهای آزاد ارتباط بگیرند. </li>
          <li>به‌وجود آوردن بستری برای پشتیبانی محلی که کاربران بتوانند پرسش‌های خود را مطرح کنند. </li>
          <li>ارائه پشتیبانی، کمک به پیشرفت و دفاع از افراد و شرکت‌ها و صنایع محلی که در بستر سیستم‌عامل گنو/لینوکس و نرم‌افزارهای آزاد و یا در پیاده‌سازی آن فعالیت می‌کنند. </li>
          <li>برگزاری و پشتیبانی از رویدادهای اجتماعی محلی با هدف ارتقای دانش و معرفی ابزارهای مرتبط </li>
          <li>ساده‌سازی دسترسی به منابع آموزشی و در صورت امکان آموزش کاربران برای استفاده از سیستم‌عامل گنو/لینوکس و نرم‌افزارهای آزاد</li>
          <li>معرفی فرصت‌های شغلی و کمک به گسترش بازار کار محلی برای کاربران سیستم‌عامل گنو/لینوکس و نرم‌افزارهای آزاد </li>
        </ul>

        <h4>چرا باید به لاگ بپیوندم؟</h4>
        <p>برای پیدا کردن دوستانی جدید؛ یاد گرفتن از افرادی که در زمینه‌هایی تخصص دارند؛ هم‌چنین حضورتون در لاگ شما رو با حوزه‌های کاری مختلف آشنا می‌کنه و ارتباط‌هایی که پیدا می‌کنید، در آینده می‌تونه بهتون کمک کنه. </p>

        <h4>چطور می‌تونم عضو لاگ بشم؟</h4>
        <p>ما سیستم عضویت رسمی یا چنین چیزی نداریم! اگر دوست دارید که قاطی موضوع بشید، به نشست‌های لاگ بیایید.</p>

        <h4>این لینوکس چی هست؟</h4>
        <p>در واقع لینوکس (Linux) یک هسته است که بطور باز متن (Open Source) توسعه داده شده و با پروانه نرم‌افزار آزاد GPLv2 منتشر می‌شود. اما بیشتر اوقات وقتی کسی می‌گوید لینوکس منظورش سیستم‌عاملی است که با این هسته یا کرنل و به همراه مجموعه نرم‌افزارهای آزاد دیگری که جزئی از پروژه گنو (GNU) هستند یا نیستند منتشر شده است. به چنین سیستم عاملی GNU/Linux یا GNU + Linux هم می‌گویند.</p>

        <h4 id="linux">گنو/لینوکس چیه؟</h4>
        <p>«گنو/لینوکس»، یک سیستم‌عامل آزاد است. شرکت‌ها و گروه‌های زیادی در سراسر دنیا نسخهٔ خاص خودشون از این سیستم‌عامل رو با میزکار و برنامه‌های متفاوت از یکدیگر منتشر می‌کنند که به این نسخه‌ها توزیع (به انگلیسی: Distribution یا کوتاه‌تر: Distro) گفته می‌شه. از معروف‌ترین‌ها می‌شه به توزیع‌های خانواده دبیان (مانند خود دبیان، اوبونتو، المنتری)، خانوادهٔ فدورا (فدورا، ردهت تجاری، سنت‌اوس)، خانوادهٔ آرچ‌لینوکس (آرچ‌لینوکس، انترگوس، مانجارو، آنارشی) و اوپن‌سوزه (اوپن‌سوزه، تامبل‌وید) اشاره کرد. از بین همهٔ این‌ها اوبونتو شاید محبوب‌تر باشه و نقطه آغاز خیلی از ما هم بوده. </p>

        <h4>چقدر لینوکس باید بلد باشم تا بتونم در نشست‌ها شرکت کنم؟</h4>
        <p> پاسخ می‌تونه «مطلقا هیچی» باشه! افرادی که در نشست‌های لاگ شرکت می‌کنند، طیف گسترده‌ای رو در بر می‌گیرند: از کاربرهای تازه‌کار گنو/لینوکس گرفته تا باتجربه‌ترها و حتی متنفرهای از گنو/لینوکس! آغوش لاگ به روی همه بازه.</p>


        <h4>من کاربر لینوکس نیستم، بیام؟</h4>
        <p> بله حتماً، ما به همهٔ افرادی که دوست دارند در مورد گنو/لینوکس بیش‌تر بدونند، خوش‌آمد می‌گیم. هیچ منعی برای حضور کاربران دیگر سیستم‌عامل‌ها (مانند ویندوز، مک، خانوادهٔ BSD) در نشست‌های لاگ وجود نداره. چه خوب که حتی با دستگاه‌های ویندوزی و... خودتون شرکت کنید. خیلی از بحث‌ها مستقل از پلتفرم و هم‌پوشان هستند. </p>

        <h4>نه‌تنها علاقه‌مندم، بلکه می‌خوام مشارکت فعال داشته باشم</h4>
        <p>اوه، چه عالی! دست هر دوستی که بخواد کمکی داشته باشه، به گرمی فشرده است. اگر خودتون پیشنهادی دارید، با ما در تماس باشید. برخی از فعالیت‌هایی که می‌تونید در اون‌ها مشارکت کنید: برگزاری و ساماندهی نشست‌های لاگ، ارائه سخنرانی، نوشتن گزارش نشست‌ها و مقاله‌های بلاگ، توسعهٔ ویکی و... . یادتون باشه که لاگ چیزی است که شما می‌سازید. </p>

        <h4>آدرس شبکه های اجتماعی</h4>
        <p>صفحه اینستاگرام: <a href="https://instagram.com/Ramsarlug/">RamsarLug@</a></p>
        <p>گروه تلگرام : <a href="https://t.me/ramsarlug">RamsarLug@</a></p>

        <h4>محل برگزاری لاگ</h4>
        <p>آدرس: <address>رامسر - ابریشم محله - نگارخانه حیاط حیات</address></p>
        <p>تلفن: <a href="tel:+981155229119">01155229119</a></p>

        <iframe className="full-map" height="350" frameBorder="0" scrolling="no" marginHeight="0" marginWidth="0" src="https://www.openstreetmap.org/export/embed.html?bbox=50.64917206764222%2C36.910545928340646%2C50.65193474292755%2C36.912385994347076&amp;layer=mapnik&amp;marker=36.9114659668923%2C50.65055340528488"></iframe><br /><small><a href="https://www.openstreetmap.org/?mlat=36.91147&amp;mlon=50.65055#map=19/36.91147/50.65055">View Larger Map</a></small>
      </div>

    </WebsiteLayout>
  );

export default About;